<template>
  <div>
    <ve-histogram :data="chartData" :colors="colors"></ve-histogram>
  </div>
</template>

<script>
export default {
    data() {
        this.colors = ['#3bb3ff', '#e6a23c', '#c23531']
        return {
          chartData: {
            columns: ['日期', '男性留言量', '女性留言量', '总留言量'],
            rows: [
              { '日期': '星期一', '总留言量': 435, '男性留言量': 200, '女性留言量': 235},
              { '日期': '星期二', '总留言量': 515, '男性留言量': 215, '女性留言量': 300},
              { '日期': '星期三', '总留言量': 306, '男性留言量': 106, '女性留言量': 200},
              { '日期': '星期四', '总留言量': 268, '男性留言量': 168, '女性留言量': 100},
              { '日期': '星期五', '总留言量': 409, '男性留言量': 259, '女性留言量': 150},
              { '日期': '星期六', '总留言量': 365, '男性留言量': 165, '女性留言量': 200},
              { '日期': '星期日', '总留言量': 286, '男性留言量': 180, '女性留言量': 106}
            ]
          }
        }
    },
    methods: {
        
    },
}
</script>

<style lang="scss" scpoed>
    
</style>