<template>
  <div>
    <ve-line :data="chartData" :colors="colors"></ve-line>
  </div>
</template>

<script>
export default {
    data() {
        this.colors = ['#3bb3ff', '#e6a23c', '#c23531']
        return {
          chartData: {
            columns: ['日期','男性访问量', '女性访问量', '总访问量'],
            rows: [
              { '日期': '星期一','男性访问量': 693, '女性访问量': 700, '总访问量': 1393, },
              { '日期': '星期二','男性访问量': 1001, '女性访问量': 560, '总访问量': 1561, },
              { '日期': '星期三','男性访问量': 412, '女性访问量': 600, '总访问量': 1012, },
              { '日期': '星期四','男性访问量': 480, '女性访问量': 410, '总访问量': 890, },
              { '日期': '星期五','男性访问量': 650, '女性访问量': 1000, '总访问量': 1650, },
              { '日期': '星期六','男性访问量': 915, '女性访问量': 900, '总访问量': 1815, },
              { '日期': '星期日','男性访问量': 612, '女性访问量': 400, '总访问量': 1012, },
            ]
          }
        }
    },
    methods: {
        
    },
}
</script>

<style lang="scss" scpoed>
    
</style>