<template>
  <div>
    <ve-scatter :data="chartData" :colors="colors"></ve-scatter>
  </div>
</template>

<script>
export default {
    data() {
        this.colors = ['#3bb3ff', '#e6a23c', '#c23531']
        return {
          chartData: {
            columns: ['类型', '男性点赞量', '女性点赞量', '总点赞量'],
            rows: [
              { '类型': '书籍专区', '男性点赞量': 630, '女性点赞量': 300, '总点赞量': 930 },
              { '类型': '视频专区', '男性点赞量': 546, '女性点赞量': 624, '总点赞量': 1170 },
              { '类型': '论坛专区', '男性点赞量': 712, '女性点赞量': 300, '总点赞量': 1012 },
              { '类型': '推荐专区', '男性点赞量': 412, '女性点赞量': 200, '总点赞量': 612 },
              { '类型': '热门专区', '男性点赞量': 312, '女性点赞量': 515, '总点赞量': 827 },
              { '类型': '下载专区', '男性点赞量': 232, '女性点赞量': 368, '总点赞量': 600 }
            ]
          }
        }
    },
    methods: {
        
    },
}
</script>

<style lang="scss" scpoed>

</style>