<template>
  <div>
    <ve-histogram :data="chartData" :colors="colors"></ve-histogram>
  </div>
</template>

<script>
export default {
    data() {
        this.colors = ['#36a3f7', '#e6a23c', '#67c23a']
        return {
          chartData: {
            columns: ['星期', '访问用户', '下单用户', '下单率'],
            rows: [
              { '星期': '星期一', '访问用户': 1393, '下单用户': 1093, '下单率': 0.32 },
              { '星期': '星期二', '访问用户': 3530, '下单用户': 3230, '下单率': 0.26 },
              { '星期': '星期三', '访问用户': 2923, '下单用户': 2623, '下单率': 0.76 },
              { '星期': '星期四', '访问用户': 1723, '下单用户': 1423, '下单率': 0.49 },
              { '星期': '星期五', '访问用户': 3792, '下单用户': 3492, '下单率': 0.323 },
              { '星期': '星期六', '访问用户': 4593, '下单用户': 4293, '下单率': 0.78 },
              { '星期': '星期日', '访问用户': 4593, '下单用户': 4293, '下单率': 0.78 },
            ]
          }
        }
    },
    methods: {
        
    },
}
</script>

<style lang="scss" scpoed>
    
</style>