<template>
  <div>
    <ve-map :data="chartData" :colors="colors"></ve-map>
  </div>
</template>

<script>
export default {
    data() {
        this.colors = ['#36a3f7', '#d53a35', '#334b5c', '#6ab0b8', '#e98f6f', '#9fdabf']
        return {
          chartData: {
            columns: ['位置', '男', '女', '总共'],
            rows: [
              { '位置': '北京', '男': 850, '女': 123, '总共': 973 },
              { '位置': '广东', '男': 1610, '女': 303, '总共': 1913 },
              { '位置': '上海', '男': 730, '女': 160, '总共': 890 },
              { '位置': '浙江', '男': 612, '女': 104, '总共': 716 },
              { '位置': '湖南', '男': 467, '女': 117, '总共': 584 },
              { '位置': '福建', '男': 519, '女': 101, '总共': 620 },
              { '位置': '江苏', '男': 751, '女': 200, '总共': 951 },
              { '位置': '重庆', '男': 419, '女': 121, '总共': 540 },
              { '位置': '新疆', '男': 136, '女': 84, '总共': 220 },
              { '位置': '四川', '男': 654, '女': 113, '总共': 767 },
              { '位置': '香港', '男': 316, '女': 95, '总共': 411 },
            ]
          }
        }
    },
    methods: {
        
    },
}
</script>

<style lang="scss" scpoed>
    
</style>